<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"9aa5515507d76ce6bd3de3ac9664963e2cebde95a0ec44f5cf6e336bf62566a9","plan_job_ref":"Job Terraform plan #1 at https://github.com/mkuthan/stream-processing/actions/runs/6592319193","plan_hash":"61ee9241f258595c8b2c7f1f96a61a75a711ebfe59b1aff4d649769eb0357a14","plan_text_format":"text","version":"1.36.2"} -->
Terraform plan in __toll-infrastructure__
<details>
<summary>Plan: 15 to add, 0 to change, 0 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_bigquery_dataset.toll-application-dataset will be created
  + resource "google_bigquery_dataset" "toll-application-dataset" {
      + creation_time              = (known after apply)
      + dataset_id                 = "****************"
      + default_collation          = (known after apply)
      + delete_contents_on_destroy = false
      + effective_labels           = (known after apply)
      + etag                       = (known after apply)
      + id                         = (known after apply)
      + is_case_insensitive        = (known after apply)
      + last_modified_time         = (known after apply)
      + location                   = "US"
      + max_time_travel_hours      = (known after apply)
      + project                    = "playground-272019"
      + self_link                  = (known after apply)
      + storage_billing_model      = (known after apply)
      + terraform_labels           = (known after apply)
    }

  # google_bigquery_table.io-diagnostic-table will be created
  + resource "google_bigquery_table" "io-diagnostic-table" {
      + creation_time       = (known after apply)
      + dataset_id          = "****************"
      + deletion_protection = true
      + effective_labels    = (known after apply)
      + etag                = (known after apply)
      + expiration_time     = (known after apply)
      + id                  = (known after apply)
      + last_modified_time  = (known after apply)
      + location            = (known after apply)
      + num_bytes           = (known after apply)
      + num_long_term_bytes = (known after apply)
      + num_rows            = (known after apply)
      + project             = "playground-272019"
      + schema              = jsonencode(
            [
              + {
                  + name = "permalink"
                  + type = "STRING"
                },
              + {
                  + name = "state"
                  + type = "STRING"
                },
            ]
        )
      + self_link           = (known after apply)
      + table_id            = "*************"
      + terraform_labels    = (known after apply)
      + type                = (known after apply)
    }

  # google_bigquery_table.toll-booth-entry-stats-table will be created
  + resource "google_bigquery_table" "toll-booth-entry-stats-table" {
      + creation_time       = (known after apply)
      + dataset_id          = "****************"
      + deletion_protection = true
      + effective_labels    = (known after apply)
      + etag                = (known after apply)
      + expiration_time     = (known after apply)
      + id                  = (known after apply)
      + last_modified_time  = (known after apply)
      + location            = (known after apply)
      + num_bytes           = (known after apply)
      + num_long_term_bytes = (known after apply)
      + num_rows            = (known after apply)
      + project             = "playground-272019"
      + schema              = jsonencode(
            [
              + {
                  + name = "permalink"
                  + type = "STRING"
                },
              + {
                  + name = "state"
                  + type = "STRING"
                },
            ]
        )
      + self_link           = (known after apply)
      + table_id            = "**********************"
      + terraform_labels    = (known after apply)
      + type                = (known after apply)
    }

  # google_bigquery_table.total-vehicle-times-diagnostic-table will be created
  + resource "google_bigquery_table" "total-vehicle-times-diagnostic-table" {
      + creation_time       = (known after apply)
      + dataset_id          = "****************"
      + deletion_protection = true
      + effective_labels    = (known after apply)
      + etag                = (known after apply)
      + expiration_time     = (known after apply)
      + id                  = (known after apply)
      + last_modified_time  = (known after apply)
      + location            = (known after apply)
      + num_bytes           = (known after apply)
      + num_long_term_bytes = (known after apply)
      + num_rows            = (known after apply)
      + project             = "playground-272019"
      + schema              = jsonencode(
            [
              + {
                  + name = "permalink"
                  + type = "STRING"
                },
              + {
                  + name = "state"
                  + type = "STRING"
                },
            ]
        )
      + self_link           = (known after apply)
      + table_id            = "******************************"
      + terraform_labels    = (known after apply)
      + type                = (known after apply)
    }

  # google_bigquery_table.total-vehicle-times-table will be created
  + resource "google_bigquery_table" "total-vehicle-times-table" {
      + creation_time       = (known after apply)
      + dataset_id          = "****************"
      + deletion_protection = true
      + effective_labels    = (known after apply)
      + etag                = (known after apply)
      + expiration_time     = (known after apply)
      + id                  = (known after apply)
      + last_modified_time  = (known after apply)
      + location            = (known after apply)
      + num_bytes           = (known after apply)
      + num_long_term_bytes = (known after apply)
      + num_rows            = (known after apply)
      + project             = "playground-272019"
      + schema              = jsonencode(
            [
              + {
                  + name = "permalink"
                  + type = "STRING"
                },
              + {
                  + name = "state"
                  + type = "STRING"
                },
            ]
        )
      + self_link           = (known after apply)
      + table_id            = "*******************"
      + terraform_labels    = (known after apply)
      + type                = (known after apply)
    }

  # google_bigquery_table.vehicle-registration-table will be created
  + resource "google_bigquery_table" "vehicle-registration-table" {
      + creation_time       = (known after apply)
      + dataset_id          = "****************"
      + deletion_protection = true
      + effective_labels    = (known after apply)
      + etag                = (known after apply)
      + expiration_time     = (known after apply)
      + id                  = (known after apply)
      + last_modified_time  = (known after apply)
      + location            = (known after apply)
      + num_bytes           = (known after apply)
      + num_long_term_bytes = (known after apply)
      + num_rows            = (known after apply)
      + project             = "playground-272019"
      + schema              = jsonencode(
            [
              + {
                  + name = "permalink"
                  + type = "STRING"
                },
              + {
                  + name = "state"
                  + type = "STRING"
                },
            ]
        )
      + self_link           = (known after apply)
      + table_id            = "********************"
      + terraform_labels    = (known after apply)
      + type                = (known after apply)
    }

  # google_bigquery_table.vehicles-with-expired-registration-diagnostic-table will be created
  + resource "google_bigquery_table" "vehicles-with-expired-registration-diagnostic-table" {
      + creation_time       = (known after apply)
      + dataset_id          = "****************"
      + deletion_protection = true
      + effective_labels    = (known after apply)
      + etag                = (known after apply)
      + expiration_time     = (known after apply)
      + id                  = (known after apply)
      + last_modified_time  = (known after apply)
      + location            = (known after apply)
      + num_bytes           = (known after apply)
      + num_long_term_bytes = (known after apply)
      + num_rows            = (known after apply)
      + project             = "playground-272019"
      + schema              = jsonencode(
            [
              + {
                  + name = "permalink"
                  + type = "STRING"
                },
              + {
                  + name = "state"
                  + type = "STRING"
                },
            ]
        )
      + self_link           = (known after apply)
      + table_id            = "*********************************************"
      + terraform_labels    = (known after apply)
      + type                = (known after apply)
    }

  # google_pubsub_subscription.toll-booth-entry-subscription will be created
  + resource "google_pubsub_subscription" "toll-booth-entry-subscription" {
      + ack_deadline_seconds       = (known after apply)
      + effective_labels           = (known after apply)
      + id                         = (known after apply)
      + message_retention_duration = "604800s"
      + name                       = "toll-booth-entry"
      + project                    = "playground-272019"
      + terraform_labels           = (known after apply)
      + topic                      = (known after apply)
    }

  # google_pubsub_subscription.toll-booth-exit-subscription will be created
  + resource "google_pubsub_subscription" "toll-booth-exit-subscription" {
      + ack_deadline_seconds       = (known after apply)
      + effective_labels           = (known after apply)
      + id                         = (known after apply)
      + message_retention_duration = "604800s"
      + name                       = "toll-booth-exit"
      + project                    = "playground-272019"
      + terraform_labels           = (known after apply)
      + topic                      = (known after apply)
    }

  # google_pubsub_subscription.vehicle-registration-subscription will be created
  + resource "google_pubsub_subscription" "vehicle-registration-subscription" {
      + ack_deadline_seconds       = (known after apply)
      + effective_labels           = (known after apply)
      + id                         = (known after apply)
      + message_retention_duration = "604800s"
      + name                       = "vehicle-registration"
      + project                    = "playground-272019"
      + terraform_labels           = (known after apply)
      + topic                      = (known after apply)
    }

  # google_pubsub_topic.toll-booth-entry-topic will be created
  + resource "google_pubsub_topic" "toll-booth-entry-topic" {
      + effective_labels = (known after apply)
      + id               = (known after apply)
      + name             = "toll-booth-entry"
      + project          = "playground-272019"
      + terraform_labels = (known after apply)
    }

  # google_pubsub_topic.toll-booth-exit-topic will be created
  + resource "google_pubsub_topic" "toll-booth-exit-topic" {
      + effective_labels = (known after apply)
      + id               = (known after apply)
      + name             = "toll-booth-exit"
      + project          = "playground-272019"
      + terraform_labels = (known after apply)
    }

  # google_pubsub_topic.vehicle-registration-topic will be created
  + resource "google_pubsub_topic" "vehicle-registration-topic" {
      + effective_labels = (known after apply)
      + id               = (known after apply)
      + name             = "vehicle-registration"
      + project          = "playground-272019"
      + terraform_labels = (known after apply)
    }

  # google_pubsub_topic.vehicles-with-expired-registration-topic will be created
  + resource "google_pubsub_topic" "vehicles-with-expired-registration-topic" {
      + effective_labels = (known after apply)
      + id               = (known after apply)
      + name             = "vehicles-with-expired-registration"
      + project          = "playground-272019"
      + terraform_labels = (known after apply)
    }

  # google_storage_bucket.toll-application-bucket will be created
  + resource "google_storage_bucket" "toll-application-bucket" {
      + effective_labels            = (known after apply)
      + force_destroy               = false
      + id                          = (known after apply)
      + location                    = "EU"
      + name                        = "playground-272019-toll-application"
      + project                     = (known after apply)
      + public_access_prevention    = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + terraform_labels            = (known after apply)
      + uniform_bucket_level_access = (known after apply)
      + url                         = (known after apply)
    }

Plan: 15 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Terraform plan #1](https://github.com/mkuthan/stream-processing/actions/runs/6592319193)